emacs_new/README.org
#+begin_src sh :shebang #!/bin/sh :results output :mkdirp yes :tangle ./setup.sh
  cd "$(dirname -- "${0}")"
  mkdir -pv -- "${HOME}/.emacs.d/snippets/"

  . "${HOME}/important_functions.sh"

  GET_EMACS_PKG () {
      get_repo "${1}"
  }

  . './get_packages.sh'

  rsync -avh --progress "${HOME}/GITHUB/aravindhv10/config_storage/emacs_new/.emacs.d/" "${HOME}/.emacs.d/"
  rsync -avh --progress "${HOME}/GITHUB/AndreaCrotti/yasnippet-snippets/snippets/" "${HOME}/.emacs.d/snippets/"
  rsync -avh --progress "${HOME}/GITHUB/aravindhv10/config_storage/emacs_new/snippets/" "${HOME}/.emacs.d/snippets/"
#+end_src

#+begin_src sh :shebang #!/bin/sh :results output :mkdirp yes :tangle ./get_packages.sh
  GET_EMACS_PKG 'https://github.com/AndreaCrotti/yasnippet-snippets.git'
  GET_EMACS_PKG 'https://github.com/Fanael/rainbow-delimiters.git'
  GET_EMACS_PKG 'https://github.com/Fanael/rainbow-identifiers.git'
  GET_EMACS_PKG 'https://github.com/Malabarba/spinner.el.git'
  GET_EMACS_PKG 'https://github.com/Wilfred/elisp-refs.git'
  GET_EMACS_PKG 'https://github.com/Wilfred/helpful.git'
  GET_EMACS_PKG 'https://github.com/Wilfred/ht.el.git'
  GET_EMACS_PKG 'https://github.com/abo-abo/avy.git'
  GET_EMACS_PKG 'https://github.com/abo-abo/hydra.git'
  GET_EMACS_PKG 'https://github.com/abo-abo/swiper.git'
  GET_EMACS_PKG 'https://github.com/bbatsov/projectile.git'
  GET_EMACS_PKG 'https://github.com/casouri/vundo.git'
  GET_EMACS_PKG 'https://github.com/company-mode/company-mode.git'
  GET_EMACS_PKG 'https://github.com/dgutov/diff-hl.git'
  GET_EMACS_PKG 'https://github.com/emacs-evil/evil-collection.git'
  GET_EMACS_PKG 'https://github.com/emacs-evil/evil.git'
  GET_EMACS_PKG 'https://github.com/emacs-lsp/lsp-mode.git'
  GET_EMACS_PKG 'https://github.com/emacsmirror/rainbow-mode.git'
  GET_EMACS_PKG 'https://github.com/emacsorphanage/htmlize.git'
  GET_EMACS_PKG 'https://github.com/emacsorphanage/key-chord.git'
  GET_EMACS_PKG 'https://github.com/flycheck/flycheck.git'
  GET_EMACS_PKG 'https://github.com/joaotavora/yasnippet.git'
  GET_EMACS_PKG 'https://github.com/jrblevin/markdown-mode.git'
  GET_EMACS_PKG 'https://github.com/magit/magit.git'
  GET_EMACS_PKG 'https://github.com/magit/transient.git'
  GET_EMACS_PKG 'https://github.com/magit/with-editor.git'
  GET_EMACS_PKG 'https://github.com/magnars/dash.el.git'
  GET_EMACS_PKG 'https://github.com/magnars/s.el.git'
  GET_EMACS_PKG 'https://github.com/noctuid/annalist.el.git'
  GET_EMACS_PKG 'https://github.com/rejeep/f.el.git'
  GET_EMACS_PKG 'https://github.com/tarsius/cond-let.git'
  GET_EMACS_PKG 'https://github.com/tarsius/llama.git'
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./paths.el
  (add-to-list 'load-path (expand-file-name "~/GITHUB/abo-abo/avy"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/abo-abo/hydra"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/abo-abo/swiper"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/AndreaCrotti/yasnippet-snippets"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/bbatsov/projectile"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/casouri/vundo"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/company-mode/company-mode"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/dgutov/diff-hl"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/emacs-evil/evil"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/emacs-evil/evil-collection"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/emacs-lsp/lsp-mode"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/emacsmirror/rainbow-mode"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/emacsorphanage/htmlize"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/emacsorphanage/key-chord"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/Fanael/rainbow-delimiters"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/Fanael/rainbow-identifiers"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/flycheck/flycheck"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/joaotavora/yasnippet"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/jrblevin/markdown-mode"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/magit/magit/lisp"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/magit/transient/lisp"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/magit/with-editor/lisp"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/magnars/dash.el"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/magnars/s.el"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/Malabarba/spinner.el"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/noctuid/annalist.el"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/rejeep/f.el"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/tarsius/cond-let"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/tarsius/llama"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/Wilfred/elisp-refs"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/Wilfred/helpful"))
  (add-to-list 'load-path (expand-file-name "~/GITHUB/Wilfred/ht.el"))
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./requires.el
  (require 'annalist)
  (require 'avy)
  (require 'company)
  (require 'cond-let)
  (require 'counsel)
  (require 'dash)
  (require 'diff-hl)
  (require 'elisp-refs)
  (require 'evil)
  (require 'evil-collection)
  (require 'f)
  (require 'flycheck)
  (require 'helpful)
  (require 'ht)
  (require 'htmlize)
  (require 'hydra)
  (require 'key-chord)
  (require 'llama)
  (require 'lsp-mode)
  (require 'magit)
  (require 'markdown-mode)
  (require 'projectile)
  (require 'rainbow-delimiters)
  (require 'rainbow-identifiers)
  (require 'rainbow-mode)
  (require 's)
  (require 'spinner)
  (require 'swiper)
  (require 'transient)
  (require 'vundo)
  (require 'with-editor)
  (require 'yasnippet)
  (require 'yasnippet-snippets)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./hooks.el
  (add-hook 'conf-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'conf-mode-hook 'rainbow-identifiers-mode)
  (add-hook 'conf-mode-hook 'rainbow-mode)
  (add-hook 'dired-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'dired-mode-hook 'rainbow-identifiers-mode)
  (add-hook 'dired-mode-hook 'rainbow-mode)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)
  (add-hook 'prog-mode-hook 'rainbow-mode)
  (add-hook 'text-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'text-mode-hook 'rainbow-identifiers-mode)
  (add-hook 'text-mode-hook 'rainbow-mode)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./bindings.el
  (global-set-key (kbd "C-;") 'avy-goto-line)
  (global-set-key (kbd "C-M-/") #'dabbrev-expand)
  (global-set-key (kbd "C-c l") #'myfun/copy-org-src-block )
  (global-set-key (kbd "C-h f") #'helpful-callable)
  (global-set-key (kbd "C-h k") #'helpful-key)
  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h x") #'helpful-command)
  (global-set-key (kbd "M-/") #'dabbrev-complete)
  (key-chord-define-global "6u" 'vundo)
  (key-chord-define-global "7u" 'vundo)
  (key-chord-define-global "8u" 'vundo)
  (key-chord-define-global "[="  'evil-window-split)
  (key-chord-define-global "\\=" 'evil-window-split)
  (key-chord-define-global "]="  'evil-window-split)
  (key-chord-define-global "o="  'evil-window-split)
  (key-chord-define-global "p="  'evil-window-split)
  (key-chord-define-global "\\'" 'evil-window-vsplit)
  (key-chord-define-global "\\;" 'evil-window-vsplit)
  (key-chord-define-global "\\[" 'evil-window-vsplit)
  (key-chord-define-global "\\]" 'evil-window-vsplit)
  (key-chord-define-global "\\l" 'evil-window-vsplit)
  (key-chord-define-global "a1" 'counsel-rg)
  (key-chord-define-global "a2" 'counsel-rg)
  (key-chord-define-global "a`" 'counsel-rg)
  (key-chord-define-global "o0" 'hydra-org/body)
  (key-chord-define-global "o8" 'hydra-org/body)
  (key-chord-define-global "o9" 'hydra-org/body)
  (key-chord-define-global "q1" 'hydra-counsel/body)
  (key-chord-define-global "q2" 'hydra-counsel/body)
  (key-chord-define-global "q`" 'hydra-counsel/body)
  (key-chord-define-global "s1" 'swiper)
  (key-chord-define-global "s2" 'swiper)
  (key-chord-define-global "s3" 'swiper)
  (key-chord-define-global "w1" 'myfun/switch_window)
  (key-chord-define-global "w2" 'myfun/switch_window)
  (key-chord-define-global "w3" 'myfun/switch_window)
  (key-chord-define-global "e3" 'counsel-switch-buffer)
  (key-chord-define-global "e4" 'counsel-switch-buffer)
  (key-chord-define-global "p9" 'hydra-projectile/body)
  (key-chord-define-global "p0" 'hydra-projectile/body)
  (key-chord-define-global "p-" 'hydra-projectile/body)
  (key-chord-define-global "t4" 'hydra-format-and-save/body)
  (key-chord-define-global "t5" 'hydra-format-and-save/body)
  (key-chord-define-global "t6" 'hydra-format-and-save/body)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./variables.el
  (setq-default indent-tabs-mode nil)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq key-chord-two-keys-delay 0.2)
  (setq modus-themes-org-blocks 'tinted-background)
  (setq org-confirm-babel-evaluate nil)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./modes.el
  (electric-pair-mode 1)
  (evil-collection-init)
  (evil-mode 1)
  (global-company-mode 1)
  (global-diff-hl-mode)
  (global-display-line-numbers-mode 1)
  (global-flycheck-mode +1)
  (ivy-mode 1)
  (key-chord-mode 1)
  (which-key-mode 1)
  (yas-global-mode 1)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./variables_post.el
  (setq vundo-glyph-alist vundo-unicode-symbols)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./functions.el
  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | ################################################################################################################################ |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | Begin functions to format and save code                                                                                          |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|

  (defun myfun/save_and_format_py ()
    (interactive)
    (setq mytmpline (line-number-at-pos))
    (shell-command-on-region (point-min) (point-max) "ruff format -" (current-buffer) t "*ruff error*" t)
    (basic-save-buffer)
    (goto-line mytmpline))

  (defun myfun/save_and_format_c ()
    (interactive)
    (setq mytmpline (line-number-at-pos))
    (shell-command-on-region (point-min) (point-max) "clang-format" (current-buffer) t "*fcc error*" t)
    (basic-save-buffer)
    (goto-line mytmpline))

  (defun myfun/save_and_format_latex ()
    (interactive)
    (setq mytmpline (line-number-at-pos))
    (shell-command-on-region (point-min) (point-max) "latexindent" (current-buffer) t "*latexindent error*" t)
    (basic-save-buffer)
    (goto-line mytmpline))

  (defun myfun/save_and_expand ()
    (interactive)
    (setq mytmpline (line-number-at-pos))
    (shell-command-on-region (point-min) (point-max) "expand" (current-buffer) t "*expand error*" t)
    (basic-save-buffer)
    (goto-line mytmpline))

  (defun myfun/copy-org-src-block ()
    (interactive)
    (org-edit-src-code)
    (kill-ring-save  (point-min) (point-max))
    (org-edit-src-abort))

  (defun myfun/switch_window ()
    (interactive)
    (other-window 1)
    (hydra-window/body))

  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | End functions to format and save code                                                                                            |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | ################################################################################################################################ |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | Begin hydra definitions                                                                                                          |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|

  (defhydra
    hydra-format-and-save (:color blue)
    "org"
    ("p" myfun/save_and_format_py "save and format python" :color blue)
    ("l" myfun/save_and_format_latex "save and format latex" :color blue)
    ("<escape>" nil "cancel" :color blue))

  (defhydra
    hydra-org (:color blue)
    "org"
    ("a" org-edit-src-abort "abort" :color blue)
    ("b" org-table-align "org-table-align" :color red)
    ("c" myfun/copy-org-src-block "copy" :color red)
    ("e" org-edit-src-code "edit" :color blue)
    ("j" org-babel-next-src-block "next src block"  :color red)
    ("k" org-babel-previous-src-block "org-babel-previous-src-block" :color red)
    (";" org-toggle-comment "comment" :color red)
    ("t" org-babel-tangle "tangle" :color red)
    ("x" org-babel-execute-src-block "exec" :color red)
    ("<escape>" nil "cancel" :color blue))

  (defhydra
    hydra-counsel (:color blue)
    "zoom"
    ("s" swiper "swiper")
    ("f" counsel-fzf "counsel-fzf")
    ("b" counsel-switch-buffer "counsel-switch-buffer")
    ("r" counsel-rg "counsel-rg")
    ("d" counsel-dired "counsel-dired")
    ("<escape>" nil "cancel" :color blue))

  (defhydra hydra-window (:color red)
    "window"
    ("w" other-window "other" :color red)
    ("s" save-buffer "save" :color red)
    ("t" tear-off-window "tear" :color red)
    ("r" toggle-frame-fullscreen "fullscreen" :color red)
    ("d" delete-window "delete_window" :color red)
    ("f" delete-frame "delete_frame" :color red)
    ("v" evil-window-vsplit "vertical split" :color red)
    ("h" evil-window-split "horizontal split" :color red)
    ("b" counsel-switch-buffer "switch_buffer" :color blue)
    ("k" kill-buffer "kill_buffer" :color blue)
    ("<escape>" nil "cancel" :color blue))

  (defhydra hydra-projectile (:color blue)
    "window"
    ("f" projectile-find-file "projectile-find-file" :color blue)
    ("d" projectile-dired "projectile-dired" :color blue)
    ("g" projectile-find-dir "projectile-find-dir" :color blue)
    ("r" projectile-ripgrep "projectile-ripgrep" :color blue)
    ("m" magit "magit" :color blue)
    ("<escape>" nil "cancel" :color blue))

  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | End hydra definitions                                                                                                            |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|
  ;; | ################################################################################################################################ |
  ;; |----------------------------------------------------------------------------------------------------------------------------------|
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./main.el
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/paths.el"))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/variables.el"))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/requires.el"))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/hooks.el"))
  (add-to-list 'company-backends '(company-dabbrev))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/modes.el"))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/variables_post.el"))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/functions.el"))
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/bindings.el"))

  (load-theme 'modus-vivendi)
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./.emacs.d/early-init.el
#+end_src

#+begin_src emacs-lisp :results silent :mkdirp yes :tangle ./.emacs.d/init.el
  (load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/main.el"))

  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(font-use-system-font t))

  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(default ((t (:family "DejaVu Sans Mono" :foundry "PfEd" :slant normal :weight bold :height 158 :width normal)))))
#+end_src


#+begin_src emacs-lisp :results silent
  (save-buffer)
  (org-babel-tangle)
#+end_src
