emacs_new/.emacs.d/init.el
(load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/paths.el"))
(load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/variables.el"))
(load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/requires.el"))
(load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/hooks.el"))
(load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/modes.el"))
(load-file (expand-file-name "~/GITHUB/aravindhv10/config_storage/emacs_new/bindings.el"))

(load-theme 'modus-vivendi)

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(font-use-system-font t))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(default ((t (:family "DejaVu Sans Mono" :foundry "PfEd" :slant normal :weight bold :height 158 :width normal)))))
